const benefits = [
   {
      id: '0001',
      title: 'Тайм-менеджмент',
      description: 'Знаю, время - деньги! Поэтому в своей работе - осуществляю планирование, ставлю цели, декомпозирую задачи, расставляю приоритеты. Это помогает определять сроки и фокусироваться на важном.'
   },
   {
      id: '0002',
      title: 'Работа в команде',
      description: 'Результат делает ни один человек, а команда! Важно эффективно выстроить коммуникацию и поддерживать благоприятный климат с коллегами. Я всегда открыт к диалогу!',
   },
   {
      id: '0003',
      title: 'Ценность для бизнеса',
      description: 'Понимаю требования бизнеса. Не зарываюсь в "фичах", которые интересны только мне. Для создания дополнительной ценности продукту - изучаю метрики, на которые могу повлиять.',
   },
   {
      id: '0004',
      title: 'Самообучение',
      description: 'Люблю разбираться в новых инструментах и технологиях, активно применяю их. Слежу за развитием актуального стека, а также в смежных технологиях, например Chat-GPT и пр.',
   },
   {
      id: '0005',
      title: 'Решение проблем',
      description: 'Понимаю, что у одной и той же задачи может быть несколько решений. Воспринимаю критику по отношении к своему подходу. Предлагаю решение, а не констатацию проблемы.',
   },
   {
      id: '0006',
      title: 'Английский язык',
      description: 'Владею английским языком на продвинутом уровне - "B2". Имею соответствующий сертификат. Свободно читаю техническую документацию на английском языке.',
   },
   {
      id: '0007',
      title: 'Позитивный настрой',
      description: 'Экстраверт по жизни. Открыт к общению и взаимодействию с командой. Позитивный настрой - залог успеха в любом деле.',
   },
];

export default benefits