const technologies = [
   {  id: "0001",
   tech1: {
      partOne: 'Владею популярным JavaScript-фреймворком ',
      partTwo: ', основанном на компонентной архитектуре и созданном для проектирования пользовательских интерфейсов и приложений.',
      keyWord: 'React'
      },
   tech2: {
      partOne: 'Также веду разработку на ',
      partTwo: '. - фреймворке в основе которого лежит React. Он предназначен для создания серверных и статичных веб-приложений. С работами реализованными на этих фреймворках можно познакомиться в разделе проекты.',
      keyWord: 'Next.js'
      }
   },
   {  id: "0002",
   tech1: {
      partOne: 'Освоил один из самых популярных языков программирования ',
      partTwo: ', а также его современные стандарты ECMAScript.',
      keyWord: 'JavaScript'
      },
      tech2: {
      partOne: 'Имею опыт практической разработки на ',
      partTwo: '. Статическая типизация этого языка обеспечивает безопасность продакшн кода. Это также может помочь улучшить взаимодействие с командой, так как код будет более понятен для других разработчиков проекта.',
      keyWord: 'TypeScript'
      }
   },
   {  id: "0003",
   tech1: {
      partOne: 'Использую менеджер состояний ',
      partTwo: ' - это отличный способ управления всем состоянием приложения.',
      keyWord: 'Redux'
      },
      tech2: {
      partOne: 'Практическую разработку веду при помощи ',
         partTwo: '. Этот инструмент использует редьюсеры и экшены в виде специальных функций - слайсов, позволяющих значительно упростить взаимодействие с хранилещем и отслеживать изменение состояния всего приложения.',
      keyWord: 'Redux Toolkit'
      }
   },
   {  id: "0004",
   tech1: {
      partOne: 'Использую в работе ',
      partTwo: ' - мощный инструмент для сборки и оптимизации web - приложения. Разработал свой персонально настроенный файл конфига, с подключенными модулями и плагинами.',
      keyWord: 'Webpack'
      },
      tech2: {
      partOne: 'Для более простых задач и небольших проектов использую сборщик ',
      partTwo: ', такие как статические сайты, где при этом для заказчика важны оптимизированные изображения и минималистичный код.',
      keyWord: 'Gulp'
      }
   },
   {  id: "0005",
   tech1: {
      partOne: 'Структура любого приложения или сайта это - ',
      partTwo: '. Он определяет организацию контента, обеспечивает функциональность и взаимодействие с пользователем, предоставляет основу для стилизации и анимации.',
      keyWord: 'HTML'
      },
   tech2: {
      partOne: 'Современный стандарт это - ',
      partTwo: ' Она повышает читаемость кода, помогает улучшить доступность сайта для людей с ограниченными возможностями. Она повышает SEO-показатели, а также увеличивает скорость загрузки.',
      keyWord: 'семантическая верстка.'
      }
   },
   {  id: "0006",
   tech1: {
      partOne: 'Активно применяю препроцессор ',
      partTwo: '. Он позволяет писать стили с использованием дополнительных функций, такие как вложенность, миксины, наследование и другое. Это помогает создавать более надежные и легко поддерживаемые стили.',
      keyWord: 'SASS'
      },
   tech2: {
   partOne: 'CSS фреймворк ',
   partTwo: ' - создан для быстрого написания стилей прямо в JSX или HTML разметке. На самом деле, мне более импонирует мудульная система написания стилей.',
   keyWord: 'Tailwind'
   }
   },
   {  id: "0007",
   tech1: {
      partOne: 'Осуществляю работу в среде разработки ',
      partTwo: '. Это среда выполнения JavaScript, которая позволяет использовать этот язык на стороне сервера.',
      keyWord: 'Node.js'
      },
      tech2: {
      partOne: 'Могу развернуть и настроить небольшой сайт или приложение на backend при помощи фреймворка ',
      partTwo: ' Он спроектирован для создания веб-приложений и API. Он может являться backend’ом для программного стека, вместе с базой данных и каркасом на React.',
      keyWord: 'Express.js'
      }
   },
   {  id: "0008",
   tech1: {
      partOne: 'Работаю с системой управления версиями ',
      partTwo: '. Она используется для контроля версий в разработке программного обеспечения, когда несколько разработчиков работают над одним проектом.',
      keyWord: 'Git'
      },
      tech2: {
      partOne: 'Свои коммерческие и pet проекты храню на платформе ',
      partTwo: '. В открытых репозиториях можно ознакомиться с исходным кодом проектов.',
      keyWord: 'GitHub'
      }
   },
];

export default technologies;